##############################################################################
# Класс позволяет генерировать валидный url из строки
##############################################################################

@CLASS
Urlify

@OPTIONS
locals



##############################################################################
@urlify[sString]
	$result[^sString.lower[]]

	^rem{ *** Заменяем пробельные символы стоящие рядом и подчеркивания на пробел *** }
	$result[^result.match[(?:\s{2,}|_)][g]{ }]

	^rem{ *** Удаляем пробельные символы по краям *** }
	$result[^result.trim[]]

	^rem{ *** Удаляем запрещенные символы *** }
	$result[^result.match[["'«»?,:!@#~`+=^$%^^&\\*()\[\]{}<>—–\.…]][g]{}]

	^rem{ *** Выполняем транслитерацию в соответствии с таблицей преобразований *** }
	$result[^Translit:translit_string[$result]]

	^rem{ *** Удаляем повторяющиеся дефисы *** }
	$result[^result.match[-{2,}][g]{-}]
#end @urlify[]
