##############################################################################
#	
##############################################################################

@CLASS
GoodsBaseColorToGoods

@OPTIONS
locals

@BASE
ActiveModel



##############################################################################
@auto[]
	^BASE:auto[]

	^rem{*** поля ***}
	^field[goods_base_color_id][
		$.type[int]
	]
	^field[goods_id][
		$.type[int]
	]

	^rem{*** аксессоры ***}

	^rem{*** валидаторы ***}

	^rem{*** ассоциации ***}
#end @auto[]
