##############################################################################
#	
##############################################################################

@CLASS
ObjectCategory

@OPTIONS
locals

@BASE
ActiveModel



##############################################################################
@auto[]
	^BASE:auto[]

	^rem{*** поля ***}
	^field[object_id][
		$.type[int]
	]
	^field[hide_series][
		$.type[bool]
	]

	^rem{*** аксессоры ***}

	^rem{*** валидаторы ***}
	^validates_uniqueness_of[object_id]

	^rem{*** ассоциации ***}
	^belongs_to[object]
#end @auto[]



##############################################################################
@before_create[]
#end @before_create[]



##############################################################################
@before_save[]
#end @before_save[]